# Определить индексы элементов массива (списка), значения которых принадлежат заданному диапазону 
# (т.е. не меньше заданного минимума и не больше заданного максимума)
# Напишите функцию
# - Аргументы: список чисел и границы диапазона
# - Возвращает: список индексов элементов (смотри условие)

# Примеры/Тесты:
# lst1 = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
# <function_name>(lst1, 2, 10) -> [1, 3, 7, 9, 10, 13, 14, 19]
# <function_name>(lst1, 2, 10) -> [1, 3, 7, 10, 13, 19]
# <function_name>(lst1, 2, 10) -> [2, 3, 6, 7, 10, 11, 16]

lst1 = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]

def range_arr(lst: list, a: int, b: int) -> list:

    lst_new = []
    for i in range (len(lst)):
        if lst[i] >= a and lst[i] <= b:
            lst_new.append(i)
    return(lst_new)

print(range_arr(lst1, 2,10))